@arsensimonyanpicsart @kbcz1989 

I can't reproduce it with a simple VM, so probably it is something about a particular VM configuration, or the import flow.

Could you provide more details about the source VM, and how exactly you were importing it?

What I did:

- deployed this simple VM:
  ```hcl
    resource "proxmox_virtual_environment_vm" "test_vm" {
    node_name = "pve"
    vm_id     = 999
    name      = "test-gpu"
  
    cpu {
      cores = 2
      sockets = 1
    }
  
    vga {
      type = "qxl"
      memory = 16
    }
  }
  ```  
  ```
  OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
    + create
  
  OpenTofu will perform the following actions:
  
    # proxmox_virtual_environment_vm.test_vm will be created
    + resource "proxmox_virtual_environment_vm" "test_vm" {
        + acpi                    = true
        + bios                    = "seabios"
        + id                      = (known after apply)
        + ipv4_addresses          = (known after apply)
        + ipv6_addresses          = (known after apply)
        + keyboard_layout         = "en-us"
        + mac_addresses           = (known after apply)
        + migrate                 = false
        + name                    = "test-gpu"
        + network_interface_names = (known after apply)
        + node_name               = "pve"
        + on_boot                 = true
        + protection              = false
        + reboot                  = false
        + scsi_hardware           = "virtio-scsi-pci"
        + started                 = true
        + stop_on_destroy         = false
        + tablet_device           = true
        + template                = false
        + timeout_clone           = 1800
        + timeout_create          = 1800
        + timeout_migrate         = 1800
        + timeout_move_disk       = 1800
        + timeout_reboot          = 1800
        + timeout_shutdown_vm     = 1800
        + timeout_start_vm        = 1800
        + timeout_stop_vm         = 300
        + vm_id                   = 999
  
        + cpu {
            + cores      = 2
            + hotplugged = 0
            + limit      = 0
            + numa       = false
            + sockets    = 1
            + type       = "qemu64"
            + units      = 1024
          }
  
        + vga {
            + memory = 16
            + type   = "qxl"
          }
      }
  
  Plan: 1 to add, 0 to change, 0 to destroy.
  proxmox_virtual_environment_vm.test_vm: Creating...
  proxmox_virtual_environment_vm.test_vm: Creation complete after 2s [id=999]
  
  Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
  ``` 
- added new resource to the template
  ```hcl
  resource "proxmox_virtual_environment_vm" "imported_vm" {
    node_name = "pve"
  }
  ```
- ran import
  ```
  ❯ tofu import proxmox_virtual_environment_vm.imported_vm pve/999
  proxmox_virtual_environment_vm.imported_vm: Importing from ID "pve/999"...
  proxmox_virtual_environment_vm.imported_vm: Import prepared!
    Prepared proxmox_virtual_environment_vm for import
  proxmox_virtual_environment_vm.imported_vm: Refreshing state... [id=999]
  
  Import successful!
  
  The resources that were imported are shown above. These resources are now in
  your OpenTofu state and will henceforth be managed by OpenTofu.
  ```
- show state
  ```
  ❯ tofu show
  # proxmox_virtual_environment_vm.imported_vm:                   
  resource "proxmox_virtual_environment_vm" "imported_vm" {
      acpi                    = true
      bios                    = "seabios"
      id                      = "999"
      ipv4_addresses          = []
      ipv6_addresses          = []
      keyboard_layout         = "en-us"
      mac_addresses           = []
      name                    = "test-gpu"
      network_interface_names = []
      node_name               = "pve"
      protection              = false
      scsi_hardware           = "virtio-scsi-pci"
      started                 = true
      tablet_device           = true
      tags                    = []
      template                = false
      vm_id                   = 999
  
      cpu {
          cores      = 2
          flags      = []
          hotplugged = 0
          limit      = 0
          numa       = false
          sockets    = 1
          type       = "qemu64"
          units      = 1024
      }
  
      vga {
          enabled = false
          memory  = 16
          type    = "qxl"
      }
  }
  
  # proxmox_virtual_environment_vm.test_vm:
  resource "proxmox_virtual_environment_vm" "test_vm" {
      acpi                    = true
      bios                    = "seabios"
      id                      = "999"
      ipv4_addresses          = []
      ipv6_addresses          = []
      keyboard_layout         = "en-us"
      mac_addresses           = []
      migrate                 = false
      name                    = "test-gpu"
      network_interface_names = []
      node_name               = "pve"
      on_boot                 = true
      protection              = false
      reboot                  = false
      scsi_hardware           = "virtio-scsi-pci"
      started                 = true
      stop_on_destroy         = false
      tablet_device           = true
      template                = false
      timeout_clone           = 1800
      timeout_create          = 1800
      timeout_migrate         = 1800
      timeout_move_disk       = 1800
      timeout_reboot          = 1800
      timeout_shutdown_vm     = 1800
      timeout_start_vm        = 1800
      timeout_stop_vm         = 300
      vm_id                   = 999
  
      cpu {
          cores      = 2
          hotplugged = 0
          limit      = 0
          numa       = false
          sockets    = 1
          type       = "qemu64"
          units      = 1024
      }
  
      vga {
          enabled = false
          memory  = 16
          type    = "qxl"
      }
  }
  ```
  The timeouts and some other arguments are missing, but `vga` is there.